In [2]:
#import library

import pandas as pd

In [5]:
#empty df

df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [6]:
#dataframe create

city=['Dhaka','Khulna','Sylhet']
city

['Dhaka', 'Khulna', 'Sylhet']

In [8]:
df=pd.DataFrame(city)
df

        0
0   Dhaka
1  Khulna
2  Sylhet

In [10]:
#type check
type(df)

pandas.core.frame.DataFrame

In [13]:
#total row and column check

df.shape
#(row,col)

(3, 1)

In [16]:
#row and column name set

df=pd.DataFrame(city,columns=['city_in_bd'],index=['c1','c2','c3'])
df

   city_in_bd
c1      Dhaka
c2     Khulna
c3     Sylhet

In [19]:
#two dataframe merge using **Zip**
city2=['kolkata','Delhi','Kashmir']
city2

['kolkata', 'Delhi', 'Kashmir']

In [21]:
df2=pd.DataFrame(zip(city,city2),columns=['city1','city2'])
df2

    city1    city2
0   Dhaka  kolkata
1  Khulna    Delhi
2  Sylhet  Kashmir

In [22]:
#two dimensional array convert in dataframe

cities=[['kolkata','Delhi','Kashmir'],['Dhaka','Khulna','Sylhet']]
cities

[['kolkata', 'Delhi', 'Kashmir'], ['Dhaka', 'Khulna', 'Sylhet']]

In [24]:
df3=pd.DataFrame(cities,index=['india','bd'])
df3

             0       1        2
india  kolkata   Delhi  Kashmir
bd       Dhaka  Khulna   Sylhet

In [28]:
#convert list---->dict----->Dataframe
#list-->dict

dic1={
    'city1':city,
    'city2':city2
}

dic1

{'city1': ['Dhaka', 'Khulna', 'Sylhet'],
 'city2': ['kolkata', 'Delhi', 'Kashmir']}

In [29]:
type(dic1)

dict

In [30]:
#dic ---->DataFrame

df4=pd.DataFrame(dic1)

df4

    city1    city2
0   Dhaka  kolkata
1  Khulna    Delhi
2  Sylhet  Kashmir